#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Apply 🚀`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/chrisnieves60/learn-terraform-github-actions2/runs/run-FoCaWZghrVDfUDdt

Waiting for the plan to start...

Terraform v1.9.1
on linux_amd64
Initializing plugins and modules...
aws_iam_role.lambda_exec: Refreshing state... [id=lambda_exec_role]
aws_vpc.my_vpc: Refreshing state... [id=vpc-06b4e93a99deba27f]
aws_api_gateway_rest_api.InsertApi: Refreshing state... [id=gbdft22xf2]
aws_iam_role.ssm_role: Refreshing state... [id=ssm_role]
aws_eip.my_eip: Refreshing state... [id=eipalloc-001f2275da08c2899]
aws_iam_role_policy.lambda_policy: Refreshing state... [id=lambda_exec_role:lambda_exec_policy]
aws_iam_role_policy_attachment.ssm_role_policy: Refreshing state... [id=ssm_role-20240709215227059600000001]
aws_lambda_function.InsertionScript: Refreshing state... [id=InsertionScript]
aws_api_gateway_method.post_method: Refreshing state... [id=agm-gbdft22xf2-xqme71qdck-POST]
aws_lambda_permission.api_gateway_invoke: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-gbdft22xf2-xqme71qdck-POST]
aws_api_gateway_deployment.InsertionDeployment: Refreshing state... [id=68s9im]
aws_internet_gateway.my_igw: Refreshing state... [id=igw-085ab54a974b4743c]
aws_subnet.my_subnet: Refreshing state... [id=subnet-0f73c88ce583f7dfb]
aws_security_group.my_security_group: Refreshing state... [id=sg-0f9c4b0898ea73551]
aws_route_table.my_route_table: Refreshing state... [id=rtb-05a82d6b9ccd599f9]
aws_route_table_association.my_route_association: Refreshing state... [id=rtbassoc-0ee994592123e54ca]
aws_iam_role_policy_attachment.ssm_role_policy: Drift detected (delete)
aws_iam_role_policy.lambda_policy: Drift detected (delete)
aws_lambda_function.InsertionScript: Drift detected (delete)
aws_iam_role.ssm_role: Drift detected (delete)
aws_lambda_permission.api_gateway_invoke: Drift detected (delete)
aws_api_gateway_method.post_method: Drift detected (delete)
aws_iam_role.lambda_exec: Drift detected (delete)
aws_api_gateway_rest_api.InsertApi: Drift detected (delete)
aws_api_gateway_integration.lambda_integration: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_api_gateway_method.post_method has been deleted
  - resource "aws_api_gateway_method" "post_method" {
      - http_method      = "POST" -> null
        id               = "agm-gbdft22xf2-xqme71qdck-POST"
        # (4 unchanged attributes hidden)
    }

  # aws_api_gateway_rest_api.InsertApi has been deleted
  - resource "aws_api_gateway_rest_api" "InsertApi" {
      - execution_arn                = "arn:aws:execute-api:us-west-2:851725414875:gbdft22xf2" -> null
      - id                           = "gbdft22xf2" -> null
        name                         = "InsertApi"
      - root_resource_id             = "xqme71qdck" -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.lambda_exec has been deleted
  - resource "aws_iam_role" "lambda_exec" {
      - arn                   = "arn:aws:iam::851725414875:role/lambda_exec_role" -> null
      - id                    = "lambda_exec_role" -> null
        name                  = "lambda_exec_role"
        # (10 unchanged attributes hidden)
    }

  # aws_iam_role.ssm_role has been deleted
  - resource "aws_iam_role" "ssm_role" {
        id                    = "ssm_role"
      - name                  = "ssm_role" -> null
        # (11 unchanged attributes hidden)
    }

  # aws_lambda_function.InsertionScript has been deleted
  - resource "aws_lambda_function" "InsertionScript" {
      - function_name                  = "InsertionScript" -> null
        id                             = "InsertionScript"
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:851725414875:function:InsertionScript/invocations" -> null
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_deployment.InsertionDeployment must be replaced
-/+ resource "aws_api_gateway_deployment" "InsertionDeployment" {
      ~ created_date  = "2024-07-09T21:52:41Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-west-2:851725414875:gbdft22xf2/dev" -> (known after apply)
      ~ id            = "68s9im" -> (known after apply)
      ~ invoke_url    = "https://gbdft22xf2.execute-api.us-west-2.amazonaws.com/dev" -> (known after apply)
      ~ rest_api_id   = "gbdft22xf2" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.lambda_integration will be created
  + resource "aws_api_gateway_integration" "lambda_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.post_method will be created
  + resource "aws_api_gateway_method" "post_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_rest_api.InsertApi will be created
  + resource "aws_api_gateway_rest_api" "InsertApi" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Insert procedure or order via api call"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "InsertApi"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration (known after apply)
    }

  # aws_eip_association.eip_assoc will be created
  + resource "aws_eip_association" "eip_assoc" {
      + allocation_id        = "eipalloc-001f2275da08c2899"
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_iam_instance_profile.ssm_instance_profile will be created
  + resource "aws_iam_instance_profile" "ssm_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ssm_instance_profile"
      + path        = "/"
      + role        = "ssm_role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.lambda_exec will be created
  + resource "aws_iam_role" "lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ssm_role will be created
  + resource "aws_iam_role" "ssm_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ssm_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.lambda_policy will be created
  + resource "aws_iam_role_policy" "lambda_policy" {
      + id     = (known after apply)
      + name   = "lambda_exec_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ssm:SendCommand",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ssm:ListCommandInvocations",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.ssm_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ssm_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "ssm_role"
    }

  # aws_instance.openemr_instance will be created
  + resource "aws_instance" "openemr_instance" {
      + ami                                  = "ami-0346dc391ea555788"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "ssm_instance_profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "OpenEMR-KeyPair"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0f73c88ce583f7dfb"
      + tags                                 = {
          + "Enviroment" = "Testing"
          + "Name"       = "OpenEMR-Tag"
        }
      + tags_all                             = {
          + "Enviroment" = "Testing"
          + "Name"       = "OpenEMR-Tag"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "3eef073d1be9ff6ca4c6f035483a57268af0bcb7"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0f9c4b0898ea73551",
        ]

      + capacity_reservation_specification (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_lambda_function.InsertionScript will be created
  + resource "aws_lambda_function" "InsertionScript" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda_function_payload.zip"
      + function_name                  = "InsertionScript"
      + handler                        = "lambda_handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "UQyV8J9GK2j5xWT9Az7sj4hY8nnV31e+QcS0qCQH57Y="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.api_gateway_invoke will be created
  + resource "aws_lambda_permission" "api_gateway_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "InsertionScript"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 13 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

<details><summary>Show Apply</summary>

```

terraform
[0m[33mRunning apply in HCP Terraform. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.[0m

Preparing the remote apply...
[0m
[0m[33mTo view this run in a browser, visit:[0m
[0m[33mhttps://app.terraform.io/app/chrisnieves60/learn-terraform-github-actions2/runs/run-7EQHDnZvWvoXdQj2[0m
[0m
Waiting for the plan to start...

Terraform v1.9.1
on linux_amd64
Initializing plugins and modules...
[1maws_eip.my_eip: Refreshing state... [id=eipalloc-001f2275da08c2899][0m[0m
[1maws_iam_role.ssm_role: Refreshing state... [id=ssm_role][0m[0m
[1maws_iam_role.lambda_exec: Refreshing state... [id=lambda_exec_role][0m[0m
[1maws_api_gateway_rest_api.InsertApi: Refreshing state... [id=gbdft22xf2][0m[0m
[1maws_vpc.my_vpc: Refreshing state... [id=vpc-06b4e93a99deba27f][0m[0m
[1maws_iam_role_policy_attachment.ssm_role_policy: Refreshing state... [id=ssm_role-20240709215227059600000001][0m[0m
[1maws_iam_role_policy.lambda_policy: Refreshing state... [id=lambda_exec_role:lambda_exec_policy][0m[0m
[1maws_lambda_function.InsertionScript: Refreshing state... [id=InsertionScript][0m[0m
[1maws_api_gateway_method.post_method: Refreshing state... [id=agm-gbdft22xf2-xqme71qdck-POST][0m[0m
[1maws_lambda_permission.api_gateway_invoke: Refreshing state... [id=AllowAPIGatewayInvoke][0m[0m
[1maws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-gbdft22xf2-xqme71qdck-POST][0m[0m
[1maws_api_gateway_deployment.InsertionDeployment: Refreshing state... [id=68s9im][0m[0m
[1maws_subnet.my_subnet: Refreshing state... [id=subnet-0f73c88ce583f7dfb][0m[0m
[1maws_internet_gateway.my_igw: Refreshing state... [id=igw-085ab54a974b4743c][0m[0m
[1maws_security_group.my_security_group: Refreshing state... [id=sg-0f9c4b0898ea73551][0m[0m
[1maws_route_table.my_route_table: Refreshing state... [id=rtb-05a82d6b9ccd599f9][0m[0m
[1maws_route_table_association.my_route_association: Refreshing state... [id=rtbassoc-0ee994592123e54ca][0m[0m
[1maws_lambda_function.InsertionScript: Drift detected (delete)[0m[0m
[1maws_api_gateway_rest_api.InsertApi: Drift detected (delete)[0m[0m
[1maws_api_gateway_method.post_method: Drift detected (delete)[0m[0m
[1maws_iam_role.lambda_exec: Drift detected (delete)[0m[0m
[1maws_iam_role.ssm_role: Drift detected (delete)[0m[0m
[1maws_iam_role_policy.lambda_policy: Drift detected (delete)[0m[0m
[1maws_lambda_permission.api_gateway_invoke: Drift detected (delete)[0m[0m
[1maws_api_gateway_integration.lambda_integration: Drift detected (delete)[0m[0m
[1maws_iam_role_policy_attachment.ssm_role_policy: Drift detected (delete)[0m[0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # aws_api_gateway_method.post_method[0m has been deleted
[0m  [31m-[0m[0m resource "aws_api_gateway_method" "post_method" {
      [31m-[0m[0m http_method      = "POST" [90m-> null[0m[0m
        id               = "agm-gbdft22xf2-xqme71qdck-POST"
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_api_gateway_rest_api.InsertApi[0m has been deleted
[0m  [31m-[0m[0m resource "aws_api_gateway_rest_api" "InsertApi" {
      [31m-[0m[0m execution_arn                = "arn:aws:execute-api:us-west-2:851725414875:gbdft22xf2" [90m-> null[0m[0m
      [31m-[0m[0m id                           = "gbdft22xf2" [90m-> null[0m[0m
        name                         = "InsertApi"
      [31m-[0m[0m root_resource_id             = "xqme71qdck" [90m-> null[0m[0m
        [90m# (9 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # aws_iam_role.lambda_exec[0m has been deleted
[0m  [31m-[0m[0m resource "aws_iam_role" "lambda_exec" {
      [31m-[0m[0m arn                   = "arn:aws:iam::851725414875:role/lambda_exec_role" [90m-> null[0m[0m
      [31m-[0m[0m id                    = "lambda_exec_role" [90m-> null[0m[0m
        name                  = "lambda_exec_role"
        [90m# (10 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_iam_role.ssm_role[0m has been deleted
[0m  [31m-[0m[0m resource "aws_iam_role" "ssm_role" {
        id                    = "ssm_role"
      [31m-[0m[0m name                  = "ssm_role" [90m-> null[0m[0m
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_lambda_function.InsertionScript[0m has been deleted
[0m  [31m-[0m[0m resource "aws_lambda_function" "InsertionScript" {
      [31m-[0m[0m function_name                  = "InsertionScript" [90m-> null[0m[0m
        id                             = "InsertionScript"
      [31m-[0m[0m invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:851725414875:function:InsertionScript/invocations" [90m-> null[0m[0m
        [90m# (24 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_api_gateway_deployment.InsertionDeployment[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_api_gateway_deployment" "InsertionDeployment" {
      [33m~[0m[0m created_date  = "2024-07-09T21:52:41Z" -> (known after apply)
      [33m~[0m[0m execution_arn = "arn:aws:execute-api:us-west-2:851725414875:gbdft22xf2/dev" -> (known after apply)
      [33m~[0m[0m id            = "68s9im" -> (known after apply)
      [33m~[0m[0m invoke_url    = "https://gbdft22xf2.execute-api.us-west-2.amazonaws.com/dev" -> (known after apply)
      [33m~[0m[0m rest_api_id   = "gbdft22xf2" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_api_gateway_integration.lambda_integration[0m will be created
[0m  [32m+[0m[0m resource "aws_api_gateway_integration" "lambda_integration" {
      [32m+[0m[0m cache_namespace         = (known after apply)
      [32m+[0m[0m connection_type         = "INTERNET"
      [32m+[0m[0m http_method             = "POST"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m integration_http_method = "POST"
      [32m+[0m[0m passthrough_behavior    = (known after apply)
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m rest_api_id             = (known after apply)
      [32m+[0m[0m timeout_milliseconds    = 29000
      [32m+[0m[0m type                    = "AWS_PROXY"
      [32m+[0m[0m uri                     = (known after apply)
    }

[1m  # aws_api_gateway_method.post_method[0m will be created
[0m  [32m+[0m[0m resource "aws_api_gateway_method" "post_method" {
      [32m+[0m[0m api_key_required = false
      [32m+[0m[0m authorization    = "NONE"
      [32m+[0m[0m http_method      = "POST"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m resource_id      = (known after apply)
      [32m+[0m[0m rest_api_id      = (known after apply)
    }

[1m  # aws_api_gateway_rest_api.InsertApi[0m will be created
[0m  [32m+[0m[0m resource "aws_api_gateway_rest_api" "InsertApi" {
      [32m+[0m[0m api_key_source               = (known after apply)
      [32m+[0m[0m arn                          = (known after apply)
      [32m+[0m[0m binary_media_types           = (known after apply)
      [32m+[0m[0m created_date                 = (known after apply)
      [32m+[0m[0m description                  = "Insert procedure or order via api call"
      [32m+[0m[0m disable_execute_api_endpoint = (known after apply)
      [32m+[0m[0m execution_arn                = (known after apply)
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m minimum_compression_size     = -1
      [32m+[0m[0m name                         = "InsertApi"
      [32m+[0m[0m policy                       = (known after apply)
      [32m+[0m[0m root_resource_id             = (known after apply)
      [32m+[0m[0m tags_all                     = (known after apply)

      [32m+[0m[0m endpoint_configuration (known after apply)
    }

[1m  # aws_eip_association.eip_assoc[0m will be created
[0m  [32m+[0m[0m resource "aws_eip_association" "eip_assoc" {
      [32m+[0m[0m allocation_id        = "eipalloc-001f2275da08c2899"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m instance_id          = (known after apply)
      [32m+[0m[0m network_interface_id = (known after apply)
      [32m+[0m[0m private_ip_address   = (known after apply)
      [32m+[0m[0m public_ip            = (known after apply)
    }

[1m  # aws_iam_instance_profile.ssm_instance_profile[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "ssm_instance_profile" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m create_date = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "ssm_instance_profile"
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m role        = "ssm_role"
      [32m+[0m[0m tags_all    = (known after apply)
      [32m+[0m[0m unique_id   = (known after apply)
    }

[1m  # aws_iam_role.lambda_exec[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda_exec" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "lambda_exec_role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # aws_iam_role.ssm_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "ssm_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "ssm_role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # aws_iam_role_policy.lambda_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy" "lambda_policy" {
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m name   = "lambda_exec_policy"
      [32m+[0m[0m policy = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "logs:CreateLogGroup",
                          [32m+[0m[0m "logs:CreateLogStream",
                          [32m+[0m[0m "logs:PutLogEvents",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "ec2:DescribeInstances",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "ssm:SendCommand",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "ssm:ListCommandInvocations",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m role   = (known after apply)
    }

[1m  # aws_iam_role_policy_attachment.ssm_role_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ssm_role_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      [32m+[0m[0m role       = "ssm_role"
    }

[1m  # aws_instance.openemr_instance[0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "openemr_instance" {
      [32m+[0m[0m ami                                  = "ami-0346dc391ea555788"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = (known after apply)
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = "ssm_instance_profile"
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t2.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "OpenEMR-KeyPair"
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m subnet_id                            = "subnet-0f73c88ce583f7dfb"
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Enviroment" = "Testing"
          [32m+[0m[0m "Name"       = "OpenEMR-Tag"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Enviroment" = "Testing"
          [32m+[0m[0m "Name"       = "OpenEMR-Tag"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = "3eef073d1be9ff6ca4c6f035483a57268af0bcb7"
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m vpc_security_group_ids               = [
          [32m+[0m[0m "sg-0f9c4b0898ea73551",
        ]

      [32m+[0m[0m capacity_reservation_specification (known after apply)

      [32m+[0m[0m ebs_block_device (known after apply)

      [32m+[0m[0m enclave_options (known after apply)

      [32m+[0m[0m ephemeral_block_device (known after apply)

      [32m+[0m[0m maintenance_options (known after apply)

      [32m+[0m[0m metadata_options (known after apply)

      [32m+[0m[0m network_interface (known after apply)

      [32m+[0m[0m private_dns_name_options (known after apply)

      [32m+[0m[0m root_block_device (known after apply)
    }

[1m  # aws_lambda_function.InsertionScript[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "InsertionScript" {
      [32m+[0m[0m architectures                  = (known after apply)
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m filename                       = "lambda_function_payload.zip"
      [32m+[0m[0m function_name                  = "InsertionScript"
      [32m+[0m[0m handler                        = "lambda_handler.lambda_handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = false
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "python3.8"
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m source_code_hash               = "UQyV8J9GK2j5xWT9Az7sj4hY8nnV31e+QcS0qCQH57Y="
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags_all                       = (known after apply)
      [32m+[0m[0m timeout                        = 300
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m ephemeral_storage (known after apply)

      [32m+[0m[0m tracing_config (known after apply)
    }

[1m  # aws_lambda_permission.api_gateway_invoke[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "api_gateway_invoke" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "InsertionScript"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = "AllowAPIGatewayInvoke"
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1mPlan:[0m 13 to add, 0 to change, 1 to destroy.
[0m
[1maws_api_gateway_deployment.InsertionDeployment: Destroying... [id=68s9im][0m[0m
[1maws_iam_role.ssm_role: Creating...[0m[0m
[1maws_api_gateway_deployment.InsertionDeployment: Destruction complete after 0s[0m[0m
[1maws_iam_role.lambda_exec: Creating...[0m[0m
[1maws_api_gateway_rest_api.InsertApi: Creating...[0m[0m
[1maws_iam_role.ssm_role: Creation complete after 1s [id=ssm_role][0m[0m
[1maws_iam_role_policy_attachment.ssm_role_policy: Creating...[0m[0m
[1maws_iam_instance_profile.ssm_instance_profile: Creating...[0m[0m
[1maws_iam_role_policy_attachment.ssm_role_policy: Creation complete after 0s [id=ssm_role-20240709220202681600000001][0m[0m
[1maws_iam_instance_profile.ssm_instance_profile: Creation complete after 0s [id=ssm_instance_profile][0m[0m
[1maws_instance.openemr_instance: Creating...[0m[0m
[1maws_iam_role.lambda_exec: Creation complete after 1s [id=lambda_exec_role][0m[0m
[1maws_iam_role_policy.lambda_policy: Creating...[0m[0m
[1maws_lambda_function.InsertionScript: Creating...[0m[0m
[1maws_api_gateway_rest_api.InsertApi: Creation complete after 1s [id=w9gw8qgulf][0m[0m
[1maws_api_gateway_method.post_method: Creating...[0m[0m
[1maws_iam_role_policy.lambda_policy: Creation complete after 0s [id=lambda_exec_role:lambda_exec_policy][0m[0m
[1maws_api_gateway_method.post_method: Creation complete after 0s [id=agm-w9gw8qgulf-xtws4zpdd6-POST][0m[0m
aws_instance.openemr_instance: Still creating... [10s elapsed]
aws_lambda_function.InsertionScript: Still creating... [10s elapsed]
[1maws_lambda_function.InsertionScript: Creation complete after 14s [id=InsertionScript][0m[0m
[1maws_lambda_permission.api_gateway_invoke: Creating...[0m[0m
[1maws_api_gateway_integration.lambda_integration: Creating...[0m[0m
[1maws_lambda_permission.api_gateway_invoke: Creation complete after 0s [id=AllowAPIGatewayInvoke][0m[0m
[1maws_api_gateway_integration.lambda_integration: Creation complete after 0s [id=agi-w9gw8qgulf-xtws4zpdd6-POST][0m[0m
[1maws_api_gateway_deployment.InsertionDeployment: Creating...[0m[0m
[1maws_api_gateway_deployment.InsertionDeployment: Creation complete after 1s [id=jamtej][0m[0m
aws_instance.openemr_instance: Still creating... [20s elapsed]
aws_instance.openemr_instance: Still creating... [30s elapsed]
aws_instance.openemr_instance: Still creating... [40s elapsed]
[1maws_instance.openemr_instance: Creation complete after 48s [id=i-0218c85f3f0662d48][0m[0m
[1maws_eip_association.eip_assoc: Creating...[0m[0m
[1maws_eip_association.eip_assoc: Creation complete after 2s [id=eipassoc-0f0b5964ee75cc9bf][0m[0m

[1m[32mApply complete! Resources: 13 added, 0 changed, 1 destroyed.[0m[0m


```

</details>

*Pushed by: @cnieves-sorenson, Action: `pull_request`*